shariltumin/wt32-eth01-nat-micropython/boards/ESP32_WT32_ETH01/mpconfigboard.h

#define MICROPY_HW_BOARD_NAME "WT32-ETH01 LAN+NAT (KAKI5)"
#define MICROPY_HW_MCU_NAME "ESP32"

#define MICROPY_PY_TINYUSB        (0)  // disable USB support
#define MICROPY_HW_ENABLE_USBDEV  (0)
#define MICROPY_PY_ESPNOW         (0)


